## Setting up
- Import Relevant Libraries
- Reading csv files

In [1]:
import pandas as pd

In [3]:
acc_data = pd.read_csv("Step Up - Experian Account Data.csv")
acc_holder = pd.read_csv("Step Up - Experian Acount Holder Data.csv")
mule_flag = pd.read_csv("Mule Flag.csv")

Display dataset

In [5]:
acc_data.head()

,Identifier,AccountLength,AverageBalance,NumTransactions,NumDeposits,NumWithdrawals,NumTransfers,NumLoans,NumCreditCards,NumSavingsAccounts
0,ID_0001,19.0,NaN,305.0,230.0,288.0,39.0,7.0,2.0,0.0
1,ID_0002,3.0,24989.0,331.0,203.0,147.0,5.0,NaN,4.0,2.0
2,ID_0003,NaN,10915.0,109.0,43.0,227.0,37.0,4.0,1.0,1.0
3,ID_0004,19.0,43552.0,87.0,149.0,236.0,168.0,1.0,2.0,1.0
4,ID_0005,9.0,19990.0,NaN,49.0,37.0,99.0,9.0,3.0,2.0

In [6]:
acc_holder.head()

,Identifier,DateOfBirth,Gender,Income,CreditScore,LoanAmount,EmploymentStatus,MaritalStatus,OccupancyStatus,NumDependents,SocialMediaUsageHours,ShoppingFrequencyPerMonth,HealthInsuranceStatus
0,ID_0001,06/01/1964,Female,96534.0,NaN,44116.0,Unemployed,Single,Owner,3.0,21.0,9.0,Yes
1,ID_0002,26/11/2004,Male,75106.0,390.0,9782.0,Unemployed,NaN,Owner,2.0,9.0,10.0,No
2,ID_0003,02/07/1992,Male,50678.0,779.0,38650.0,Student,Divorced,Owner,3.0,16.0,5.0,Yes
3,ID_0004,03/07/1974,Male,96218.0,757.0,22366.0,Student,Single,Owner,1.0,21.0,0.0,No
4,ID_0005,13/05/1976,Male,83230.0,750.0,28557.0,Employed,Single,Owner,1.0,11.0,5.0,No

In [11]:
mule_flag.head()

  Identifier  MuleAccount
0    ID_0001          0.0
1    ID_0002          0.0
2    ID_0003          NaN
3    ID_0004          NaN
4    ID_0005          0.0

## Data Audit

Account Data

In [8]:
acc_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Identifier          1000 non-null   object
 1   AccountLength       948 non-null    float64
 2   AverageBalance      948 non-null    float64
 3   NumTransactions     948 non-null    float64
 4   NumDeposits         948 non-null    float64
 5   NumWithdrawals      948 non-null    float64
 6   NumTransfers        948 non-null    float64
 7   NumLoans            948 non-null    float64
 8   NumCreditCards      949 non-null    float64
 9   NumSavingsAccounts  948 non-null    float64
dtypes: float64(9), object(1)
memory usage: 78.3+ KB

In [9]:
acc_data.isnull().sum()

Identifier             0
AccountLength         52
AverageBalance        52
NumTransactions       52
NumDeposits           52
NumWithdrawals        52
NumTransfers          52
NumLoans              52
NumCreditCards        51
NumSavingsAccounts    52
dtype: int64

Account Holder

In [14]:
acc_holder.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1045 entries, 0 to 1044
Data columns (total 13 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Identifier                 1045 non-null   object
 1   DateOfBirth                991 non-null    object
 2   Gender                     992 non-null    object
 3   Income                     989 non-null    float64
 4   CreditScore                987 non-null    float64
 5   LoanAmount                 990 non-null    float64
 6   EmploymentStatus           987 non-null    object
 7   MaritalStatus              989 non-null    object
 8   OccupancyStatus            990 non-null    object
 9   NumDependents              990 non-null    float64
 10  SocialMediaUsageHours      985 non-null    float64
 11  ShoppingFrequencyPerMonth  990 non-null    float64
 12  HealthInsuranceStatus      989 non-null    object
dtypes: float64(6), object(7)
memory usage: 106.3+ KB

Mule Flag

In [12]:
mule_flag.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Identifier   1000 non-null   object
 1   MuleAccount  948 non-null    float64
dtypes: float64(1), object(1)
memory usage: 15.8+ KB

In [13]:
mule_flag['MuleAccount'].unique()

array([ 0., nan,  1.])